spec/fixtures/requests/ship/intl_multi_package_2.xml

<env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
  <env:Body>
    <n1:ProcessShipmentRequest xmlns:n1="http://fedex.com/ws/ship/v8">
      <n1:WebAuthenticationDetail>
        <n1:UserCredential>
          <n1:Key></n1:Key>
          <n1:Password></n1:Password>
        </n1:UserCredential>
      </n1:WebAuthenticationDetail>
      <n1:ClientDetail>
        <n1:AccountNumber></n1:AccountNumber>
        <n1:MeterNumber></n1:MeterNumber>
      </n1:ClientDetail>
      <n1:Version>
        <n1:ServiceId>ship</n1:ServiceId>
        <n1:Major>8</n1:Major>
        <n1:Intermediate>0</n1:Intermediate>
        <n1:Minor>0</n1:Minor>
      </n1:Version>
      <n1:RequestedShipment>
        <n1:ShipTimestamp></n1:ShipTimestamp>
        <n1:DropoffType>REGULAR_PICKUP</n1:DropoffType>
        <n1:ServiceType>INTERNATIONAL_ECONOMY</n1:ServiceType>
        <n1:PackagingType>YOUR_PACKAGING</n1:PackagingType>
        <n1:PreferredCurrency>USD</n1:PreferredCurrency>
        <n1:Shipper>
          <n1:Contact>
            <n1:PersonName>Shipper Name</n1:PersonName>
            <n1:PhoneNumber>5555555555</n1:PhoneNumber>
          </n1:Contact>
          <n1:Address>
            <n1:StreetLines>123 4th St</n1:StreetLines>
            <n1:City>Austin</n1:City>
            <n1:StateOrProvinceCode>TX</n1:StateOrProvinceCode>
            <n1:PostalCode>78701</n1:PostalCode>
            <n1:CountryCode>US</n1:CountryCode>
          </n1:Address>
        </n1:Shipper>
        <n1:Recipient>
          <n1:Contact>
            <n1:PersonName>Metrotown Centre</n1:PersonName>
            <n1:PhoneNumber>4444444444</n1:PhoneNumber>
          </n1:Contact>
          <n1:Address>
            <n1:StreetLines>4800 Kingsway</n1:StreetLines>
            <n1:City>Burnaby</n1:City>
            <n1:StateOrProvinceCode>BC</n1:StateOrProvinceCode>
            <n1:PostalCode>V5H4J2</n1:PostalCode>
            <n1:CountryCode>CA</n1:CountryCode>
            <n1:Residential>false</n1:Residential>
          </n1:Address>
        </n1:Recipient>
        <n1:ShippingChargesPayment>
          <n1:PaymentType>SENDER</n1:PaymentType>
          <n1:Payor>
            <n1:AccountNumber></n1:AccountNumber>
            <n1:CountryCode>US</n1:CountryCode>
          </n1:Payor>
        </n1:ShippingChargesPayment>
        <n1:InternationalDetail>
          <n1:DutiesPayment>
            <n1:PaymentType>SENDER</n1:PaymentType>
            <n1:Payor>
              <n1:AccountNumber></n1:AccountNumber>
              <n1:CountryCode>US</n1:CountryCode>
            </n1:Payor>
          </n1:DutiesPayment>
          <n1:DocumentContent>NON_DOCUMENTS</n1:DocumentContent>
          <n1:CustomsValue>
            <n1:Currency>USD</n1:Currency>
            <n1:Amount>300</n1:Amount>
          </n1:CustomsValue>
          <n1:Commodities>
            <n1:Name>PKG2 - Commodity A</n1:Name>
            <n1:NumberOfPieces>1</n1:NumberOfPieces>
            <n1:Description>Description of PKG2 - Commodity A</n1:Description>
            <n1:CountryOfManufacture>US</n1:CountryOfManufacture>
            <n1:HarmonizedCode>060110</n1:HarmonizedCode>
            <n1:Weight>
              <n1:Units>LB</n1:Units>
              <n1:Value>1</n1:Value>
            </n1:Weight>
            <n1:Quantity>1</n1:Quantity>
            <n1:QuantityUnits>EA</n1:QuantityUnits>
            <n1:UnitPrice>
              <n1:Currency>USD</n1:Currency>
              <n1:Amount>100</n1:Amount>
            </n1:UnitPrice>
            <n1:CustomsValue>
              <n1:Currency>USD</n1:Currency>
              <n1:Amount>100</n1:Amount>
            </n1:CustomsValue>
          </n1:Commodities>
        </n1:InternationalDetail>
        <n1:LabelSpecification>
          <n1:LabelFormatType>COMMON2D</n1:LabelFormatType>
          <n1:ImageType>PDF</n1:ImageType>
          <n1:LabelStockType>PAPER_8.5X11_TOP_HALF_LABEL</n1:LabelStockType>
        </n1:LabelSpecification>
        <n1:RateRequestTypes>LIST</n1:RateRequestTypes>
        <n1:EdtRequestType>ALL</n1:EdtRequestType>
        <n1:MasterTrackingId>
          <n1:TrackingNumber>794802593925</n1:TrackingNumber>
        </n1:MasterTrackingId>
        <n1:PackageCount>2</n1:PackageCount>
        <n1:PackageDetail>INDIVIDUAL_PACKAGES</n1:PackageDetail>
        <n1:RequestedPackageLineItems>
          <n1:SequenceNumber>2</n1:SequenceNumber>
          <n1:Weight>
            <n1:Units>LB</n1:Units>
            <n1:Value>1</n1:Value>
          </n1:Weight>
          <n1:SpecialServicesRequested>
          </n1:SpecialServicesRequested>
        </n1:RequestedPackageLineItems>
      </n1:RequestedShipment>
    </n1:ProcessShipmentRequest>
  </env:Body>
</env:Envelope>